provider.tf:
```tf
variable "ibmcloud_api_key" {}

provider "ibm" {
    ibmcloud_api_key = var.ibmcloud_api_key
    generation = 1
    region = "eu-gb"
}
```

kp.tf:
```tf
resource "ibm_resource_instance" "test_kp_instance_eu_gb" {
    name = "test-keyprotect-instance"
    service = "kms"
    plan = "tiered-pricing"
    location = "eu-gb"
}

resource "ibm_kms_key" "test_key" {
    instance_id = ibm_resource_instance.test_kp_instance_eu_gb.guid
    key_name = "test_key"
    standard_key = false
    force_delete = false
}
```

Before changes:
```
> terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_kms_key.test_key will be created
  + resource "ibm_kms_key" "test_key" {
      + crn                     = (known after apply)
      + endpoint_type           = "public"
      + force_delete            = false
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + key_id                  = (known after apply)
      + key_name                = "test_key"
      + payload                 = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + standard_key            = false
      + type                    = (known after apply)
    }

  # ibm_resource_instance.test_kp_instance_eu_gb will be created
  + resource "ibm_resource_instance" "test_kp_instance_eu_gb" {
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "eu-gb"
      + name                    = "test-keyprotect-instance"
      + plan                    = "tiered-pricing"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "kms"
      + status                  = (known after apply)
      + tags                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_resource_instance.test_kp_instance_eu_gb: Creating...
ibm_resource_instance.test_kp_instance_eu_gb: Still creating... [10s elapsed]
ibm_resource_instance.test_kp_instance_eu_gb: Creation complete after 17s [id=crn:v1:bluemix:public:kms:eu-gb:a/8e736a69fb81ec7d76bc3d68d45c5902:8d6699c3-a6ca-4ea1-9fe6-db7a18f38016::]
ibm_kms_key.test_key: Creating...

Error: Error occured while configuring hpcs Endpoint: "ServiceEndpointDoesnotExist: HPCS Service endpoint doesn't exist for region: \"eu-gb\""

  on kp.tf line 8, in resource "ibm_kms_key" "test_key":
   8: resource "ibm_kms_key" "test_key" {
```

After fix:
```
> terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_kms_key.test_key will be created
  + resource "ibm_kms_key" "test_key" {
      + crn                     = (known after apply)
      + endpoint_type           = "public"
      + force_delete            = false
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + key_id                  = (known after apply)
      + key_name                = "test_key"
      + payload                 = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + standard_key            = false
      + type                    = (known after apply)
    }

  # ibm_resource_instance.test_kp_instance_eu_gb will be created
  + resource "ibm_resource_instance" "test_kp_instance_eu_gb" {
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "eu-gb"
      + name                    = "test-keyprotect-instance"
      + plan                    = "tiered-pricing"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "kms"
      + status                  = (known after apply)
      + tags                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_resource_instance.test_kp_instance_eu_gb: Creating...
ibm_resource_instance.test_kp_instance_eu_gb: Still creating... [10s elapsed]
ibm_resource_instance.test_kp_instance_eu_gb: Creation complete after 16s [id=crn:v1:bluemix:public:kms:eu-gb:a/8e736a69fb81ec7d76bc3d68d45c5902:4695450d-5796-438c-891a-183e1f9b0aa7::]
ibm_kms_key.test_key: Creating...
ibm_kms_key.test_key: Creation complete after 2s [id=crn:v1:bluemix:public:kms:eu-gb:a/8e736a69fb81ec7d76bc3d68d45c5902:4695450d-5796-438c-891a-183e1f9b0aa7:key:5c93908a-3c67-41c0-8ba5-f9cf9bbb10b2]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```